import {Observable, of} from 'rxjs';
import {IMember} from '../../interfaces';
import {Injectable} from '@angular/core';

const MockAgents: IMember[] = [
  {
    id: 'user_04',
    profile: 'assets/images/pepole/hossein.png',
    fullName: 'حسین 4 علیزاده',
    role: {
      id: 'agent',
      title: 'نماینده'
    },
    detail: {
      location: {
        state: 'هرمزگان',
        city: 'بندر عباس'
      },
      about: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم' +
        ' از صنعت چاپ و با استفاده از طراحان گرافیک' +
        ' است چاپگرها و متون بلکه روزنامه و مجله در' +
        ' ستون و سطرآنچنان که لازم است و برای شرایط ' +
        'فعلی تکنولوژی مورد نیاز و کاربردهای متنوع ' +
        'با هدف بهبود ابزارهای کاربردی می باشد',
      activeTours: [
        'place_1',
        'place_2',
        'place_3'
      ],
      address: 'تهران بزرگراه ' +
        'ستاری بلوار شهید مخبری نبش خیابان ' +
        'ایران زمین، ديوان عدالت اداري. تهران ' +
        'بزرگراه ستاری بلوار شهید مخبری نبش ' +
        'خیابان ایران زمین، ديوان عدالت اداري ',
      phone: '09333333333'
    }
  },
  {
    id: 'user_05',
    profile: 'assets/images/pepole/hossein.png',
    fullName: 'حسین 4 علیزاده',
    role: {
      id: 'agent',
      title: 'نماینده'
    },
    detail: {
      location: {
        state: 'هرمزگان',
        city: 'بندر عباس'
      },
      about: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم' +
        ' از صنعت چاپ و با استفاده از طراحان گرافیک' +
        ' است چاپگرها و متون بلکه روزنامه و مجله در' +
        ' ستون و سطرآنچنان که لازم است و برای شرایط ' +
        'فعلی تکنولوژی مورد نیاز و کاربردهای متنوع ' +
        'با هدف بهبود ابزارهای کاربردی می باشد',
      activeTours: [
        'place_1',
        'place_2',
        'place_3'
      ],
      address: 'تهران بزرگراه ' +
        'ستاری بلوار شهید مخبری نبش خیابان ' +
        'ایران زمین، ديوان عدالت اداري. تهران ' +
        'بزرگراه ستاری بلوار شهید مخبری نبش ' +
        'خیابان ایران زمین، ديوان عدالت اداري ',
      phone: '09333333333'
    }
  },
  {
    id: 'user_06',
    profile: 'assets/images/pepole/hossein.png',
    fullName: 'حسین 4 علیزاده',
    role: {
      id: 'agent',
      title: 'نماینده'
    },
    detail: {
      location: {
        state: 'هرمزگان',
        city: 'بندر عباس'
      },
      about: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم' +
        ' از صنعت چاپ و با استفاده از طراحان گرافیک' +
        ' است چاپگرها و متون بلکه روزنامه و مجله در' +
        ' ستون و سطرآنچنان که لازم است و برای شرایط ' +
        'فعلی تکنولوژی مورد نیاز و کاربردهای متنوع ' +
        'با هدف بهبود ابزارهای کاربردی می باشد',
      activeTours: [
        'place_1',
        'place_2',
        'place_3'
      ],
      address: 'تهران بزرگراه ' +
        'ستاری بلوار شهید مخبری نبش خیابان ' +
        'ایران زمین، ديوان عدالت اداري. تهران ' +
        'بزرگراه ستاری بلوار شهید مخبری نبش ' +
        'خیابان ایران زمین، ديوان عدالت اداري ',
      phone: '09333333333'
    }
  },
  {
    id: 'user_07',
    profile: 'assets/images/pepole/hossein.png',
    fullName: 'حسین 4 علیزاده',
    role: {
      id: 'agent',
      title: 'نماینده'
    },
    detail: {
      location: {
        state: 'هرمزگان',
        city: 'بندر عباس'
      },
      about: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم' +
        ' از صنعت چاپ و با استفاده از طراحان گرافیک' +
        ' است چاپگرها و متون بلکه روزنامه و مجله در' +
        ' ستون و سطرآنچنان که لازم است و برای شرایط ' +
        'فعلی تکنولوژی مورد نیاز و کاربردهای متنوع ' +
        'با هدف بهبود ابزارهای کاربردی می باشد',
      activeTours: [
        'place_1',
        'place_2',
        'place_3'
      ],
      address: 'تهران بزرگراه ' +
        'ستاری بلوار شهید مخبری نبش خیابان ' +
        'ایران زمین، ديوان عدالت اداري. تهران ' +
        'بزرگراه ستاری بلوار شهید مخبری نبش ' +
        'خیابان ایران زمین، ديوان عدالت اداري ',
      phone: '09333333333'
    }
  },
  {
    id: 'user_08',
    profile: 'assets/images/pepole/hossein.png',
    fullName: 'حسین 4 علیزاده',
    role: {
      id: 'agent',
      title: 'نماینده'
    },
    detail: {
      location: {
        state: 'هرمزگان',
        city: 'بندر عباس'
      },
      about: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم' +
        ' از صنعت چاپ و با استفاده از طراحان گرافیک' +
        ' است چاپگرها و متون بلکه روزنامه و مجله در' +
        ' ستون و سطرآنچنان که لازم است و برای شرایط ' +
        'فعلی تکنولوژی مورد نیاز و کاربردهای متنوع ' +
        'با هدف بهبود ابزارهای کاربردی می باشد',
      activeTours: [
        'place_1',
        'place_2',
        'place_3'
      ],
      address: 'تهران بزرگراه ' +
        'ستاری بلوار شهید مخبری نبش خیابان ' +
        'ایران زمین، ديوان عدالت اداري. تهران ' +
        'بزرگراه ستاری بلوار شهید مخبری نبش ' +
        'خیابان ایران زمین، ديوان عدالت اداري ',
      phone: '09333333333'
    }
  }
];

@Injectable()
export class AgentsService {
  constructor() {
  }

  getAgents(): Observable<IMember[]> {
    return of(MockAgents);
  }

  getAgentById(agentId: string): Observable<IMember> {
    const theAgent = MockAgents.find(agent => agent.id === agentId);
    return of(theAgent);
  }
}
