import {Injectable} from '@angular/core';
import {Observable, of} from 'rxjs';
import {IInfoBox} from '../../interfaces';

const MockInfos: IInfoBox[] = [
  {
    id: 'about-us',
    title: 'درباره ما',
    description: 'شرکت برقع سحر آمیز سفر با برند ناخدا با بیش از 13سال سابقه و تجربه در صنعت گردشگری در آذر ماه 1398 شروع به کار کرد.\n' +
      'این شرکت با تمرکز برروی تور و گردشگری داخل استان در شروع قعالیت خود به صورت هفتگی مجری برگزاری تور بوده و با ارائه خدمات با کیفیت به همسفرانش، پیشرو در بین آژانس های گردشگری استان هرمزگان بوده است.\n' +
      'یکی از مهمترین برنامه های راهبردی مجموعه ی ناخدا، شناساندن، احیا و محافظت از مناطق ناشناخته و کمتر شناخته شده استان هرمزگان است؛ ما با انجام سفر های مسئولانه، با تیمی کاملا حرفه ای تجربه ی واقعی از سفر را برای شما محیا خواهیم کرد.\n' +
      'از دیگر فعالیت های راهبردی ناخدا میتوان به خرید بلیت های داخلی و خارجی با مناسب ترین قیمت، اخذ ویزا و رزرو هتل در کوتاه ترین زمان ممکن، مشاوره ی سفر و انجام تورهای تخصصی و سفارشی اشاره کرد.',
  },
  {
    id: 'about-agents',
    title: 'نمایندگان ما',
    description: ' ما برای راحتی بیشتر شما، در هر شهر نمایندگانی را قرار\n' +
      ' دادیم تا به راحتی بتوانید به جاذبه‌ی دیدنی مورد علاقه‌ی\n' +
      ' خود در آن شهر سفر کنید و آنها در این امر راهنماییتان\n' +
      ':می‌کنند. در ادامه لیست این نمایندگان را می‌بینید',
  }
];

@Injectable()
export class InfoService {
  constructor() {
  }

  getInfo(infoId: string): Observable<IInfoBox> {
    const theInfo = MockInfos.find(info => info.id === infoId);
    return of(theInfo);
  }
}
